Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: `ACTION_TEMPLATE` and `ACTION`/`ACTION_P*` can be overloaded on the number of value parameters, but not on the number of template parameters.
it_it: `ACTION_TEMPLATE` e `ACTION`/`ACTION_P*` si possono overload-are sul numero di parametri valore, ma non sul numero di parametri template.

source: `ASSERT_*()` can only be used in `void` functions, due to exceptions being disabled by our build system.
it_it: `ASSERT_*()` può essere utilizzato solo nelle funzioni `void`, poiché le eccezioni sono disabilitate dal nostro sistema di build.

source: `ASSERT_*` versions generate fatal failures when they fail, and **abort the current function**.
it_it: Le versioni `ASSERT_*` generano errori fatali quando falliscono e **interrompono la funzione corrente**.

source: `ASSERT_DEATH(statement, matcher)` (or any death assertion macro) can be used wherever *`statement`* is valid.
it_it: `ASSERT_DEATH(statement, matcher)` (o qualsiasi macro di asserzione death) può essere utilizzato ovunque sia valido *`statement`*.

source: `AbslStringify()` can also use `absl::StrFormat`'s catch-all `%v` type specifier within its own format strings to perform type deduction.
it_it: `AbslStringify()` può anche usare l'identificatore di tipo "tuttofare" `%v` di `absl::StrFormat`', all'interno delle proprie stringhe di formato per eseguire la deduzione del tipo.

source: `AddressSatisfies(callback)` and `Truly(callback)` take ownership of `callback`, which must be a permanent callback.
it_it: `AddressSatisfies(callback)` e `Truly(callback) prendono la proprietà di `callback`, che deve essere una callback permanente.

source: `AllOfArray({m0, m1, ..., mn})`, `AllOfArray(a_container)`, `AllOfArray(begin, end)`, `AllOfArray(array)`, or `AllOfArray(array, count)`
it_it: `AllOfArray({m0, m1, ..., mn})`, `AllOfArray(a_container)`, `AllOfArray(begin, end)`, `AllOfArray(array)` o `AllOfArray(array, count)`

source: `AnyOfArray({m0, m1, ..., mn})`, `AnyOfArray(a_container)`, `AnyOfArray(begin, end)`, `AnyOfArray(array)`, or `AnyOfArray(array, count)`
it_it: `AnyOfArray({m0, m1, ..., mn})`, `AnyOfArray(a_container)`, `AnyOfArray(begin, end)`, `AnyOfArray(array)` o `AnyOfArray(array, count)`

source: `Concrete`'s API may not fit your problem domain very well, as you may not be the only client it tries to serve.
it_it: L'API di `Concrete` potrebbe non adattarsi molto bene al dominio del problema, poiché si potrebbe non essere l'unico cliente che si tenta di servire.

source: `ContainsRegex()` and `MatchesRegex()` take ownership of the `RE` object.
it_it: `ContainsRegex()` e `MatchesRegex()` assumono la proprietà dell'oggetto `RE`.

source: `DoAll()` allows you to do a sequence of actions every time.
it_it: `DoAll()` consente di eseguire una sequenza di azioni ogni volta.

source: `DoubleEq()` and `FloatEq()` conform to the IEEE standard, which requires comparing two NaNs for equality to return false.
it_it: `DoubleEq()` e `FloatEq()` sono conformi allo standard IEEE, che richiede il confronto di due NaN affinché l'uguaglianza restituisca false.

source: `EXPECT_*` versions generate nonfatal failures, which don't abort the current function.
it_it: Le versioni `EXPECT_*` generano errori non fatali, che non interrompono la funzione corrente.

source: `EXPECT_CALL` must precede any code that exercises the mock object.
it_it: `EXPECT_CALL` deve precedere qualsiasi codice che eserciti l'oggetto mock.

source: `EXPECT_CALL` not only defines the behavior, but also sets an expectation that <em>the method will be called with the given arguments, for the given number of times</em> (and *in the given order* when you specify the order too).
it_it: `EXPECT_CALL` non solo definisce il comportamento, ma imposta anche l'aspettativa [expectation] che <em>il metodo venga chiamato con gli argomenti dati, per il numero dato di volte</em> (e *nell'ordine indicato* quando si specifica anche l'ordine).

source: `ElementsAre*()` can be used to match *any* container that implements the STL iterator pattern (i.e. it has a `const_iterator` type and supports `begin()/end()`), not just the ones defined in STL.
it_it: `ElementsAre*()` è utilizzabile per [to match] *qualsiasi* container che implementi il pattern dell'iteratore STL (ovvero ha un tipo `const_iterator` e supporta `begin()/end()`), non solo quelli definiti in STL.

source: `Eq(value)` or `value`
it_it: `Eq(value)` o `value`

source: `Exactly(n)` or `n`
it_it: `Exactly(n)` o `n`

source: `Field()` and `Property()` can also match plain pointers to objects.
it_it: `Field()` e `Property()` possono anche eseguire il match di semplici puntatori a oggetti.

source: `GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST` suppresses this failure for the given test suite.
it_it: `GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST` sopprime questo errore per la test suite specificata.

source: `GTEST_SKIP()` can be used in individual test cases or in the `SetUp()` methods of classes derived from either `::testing::Environment` or `::testing::Test`.
it_it: `GTEST_SKIP()` è utilizzabile nei casi di test individuali o nei metodi `SetUp()` di una classe derivata da `::testing::Environment` o da `::testing::Test`.

source: `HasFatalFailure()` in the `::testing::Test` class returns `true` if an assertion in the current test has suffered a fatal failure.
it_it: `HasFatalFailure()` nella classe `::testing::Test` restituisce `true` se un'asserzione nel test corrente ha subito un fallimento fatale.

source: `IgnoreResult()` lets you do that.
it_it: `IgnoreResult()` consente di farlo.

source: `Invoke()` passes the mock function's arguments to the function, etc being invoked such that the callee has the full context of the call to work with.
it_it: `Invoke()` passa gli argomenti della funzione mock alla funzione, ecc. invocata in modo tale che il chiamato abbia l'intero contesto della chiamata con cui lavorare..

source: `Invoke(callback)` and `InvokeWithoutArgs(callback)` take ownership of `callback`, which must be permanent.
it_it: `Invoke(callback)` e `InvokeWithoutArgs(callback)` assumono la proprietà di `callback`, che deve essere permanente.

source: `IsSupersetOf({e0, e1, ..., en})`, `IsSupersetOf(a_container)`, `IsSupersetOf(begin, end)`, `IsSupersetOf(array)`, or `IsSupersetOf(array, count)`
it_it: `IsSupersetOf({e0, e1, ..., en})`, `IsSupersetOf(a_container)`, `IsSupersetOf(begin, end)`, `IsSupersetOf(array)` o `IsSupersetOf(array, count)`

source: `IsTrue` and `IsFalse` are useful when you need to use a matcher, or for types that can be explicitly converted to Boolean, but are not implicitly converted to Boolean.
it_it: `IsTrue` e `IsFalse` sono utili quando è necessario utilizzare un matcher o per tipi che possono essere convertiti esplicitamente in booleano, ma non lo sono implicitamente.

source: `MOCK_METHOD` must be used in the `public:` section of a mock class definition, regardless of whether the method being mocked is `public`, `protected`, or `private` in the base class.
it_it: `MOCK_METHOD` deve essere utilizzata nella sezione `public:` di una definizione di classe mock, indipendentemente dal fatto che il metodo mock-ato sia `public`, `protected` o `private` nella classe base.

source: `MOCK_METHOD` removes the parentheses.
it_it: `MOCK_METHOD` rimuove le parentesi.

source: `MatcherCast` essentially lets you bypass C++'s type system (`static_cast` isn't always safe as it could throw away information, for example), so be careful not to misuse/abuse it.
it_it: `MatcherCast` consente essenzialmente di aggirare il sistema di tipi di C++ (`static_cast` non è sempre sicuro in quanto potrebbe eliminare informazioni, ad esempio), si faccia quindi attenzione a non abusarne.

source: `MeenyMinyMoe/FooTest.DoesBlah/0` for `"meeny"`
it_it: `MeenyMinyMoe/FooTest.DoesBlah/0` per `"meeny"`

source: `MeenyMinyMoe/FooTest.DoesBlah/1` for `"miny"`
it_it: `MeenyMinyMoe/FooTest.DoesBlah/1` per `"miny"`

source: `MeenyMinyMoe/FooTest.DoesBlah/2` for `"moe"`
it_it: `MeenyMinyMoe/FooTest.DoesBlah/2` per `"moe"`

source: `MeenyMinyMoe/FooTest.HasBlahBlah/0` for `"meeny"`
it_it: `MeenyMinyMoe/FooTest.HasBlahBlah/0` per `"meeny"`

source: `MeenyMinyMoe/FooTest.HasBlahBlah/1` for `"miny"`
it_it: MeenyMinyMoe/FooTest.HasBlahBlah/1` per `"miny"`

source: `MeenyMinyMoe/FooTest.HasBlahBlah/2` for `"moe"`
it_it: `MeenyMinyMoe/FooTest.HasBlahBlah/2` per `"moe"`

source: `MockFunction<R(T1, ..., Tn)>` has a mock method `Call()` with the signature:
it_it: `MockFunction<R(T1, ..., Tn)>` ha un metodo mock `Call()` con la signature:

source: `NaggyMock<T>` is a subclass of `T`, so it can be used wherever an object of type `T` is accepted.
it_it: `NaggyMock<T>` è una sottoclasse di `T`, quindi può essere utilizzata ovunque sia accettato un oggetto di tipo `T`.

source: `NiceMock<MockFoo>` and `StrictMock<MockFoo>` may not work correctly if the destructor of `MockFoo` is not virtual.
it_it: `NiceMock<MockFoo>` e `StrictMock<MockFoo>` potrebbero non funzionare correttamente se il distruttore di `MockFoo` non è virtuale.

source: `NiceMock<MockFoo>` and `StrictMock<MockFoo>` only work for mock methods defined using the `MOCK_METHOD` macro **directly** in the `MockFoo` class.
it_it: `NiceMock<MockFoo>` e `StrictMock<MockFoo>` funzionano solo per i metodi mock definiti utilizzando la macro `MOCK_METHOD` **direttamente** nella classe `MockFoo`.

source: `NiceMock<MockFoo>` is a subclass of `MockFoo`, so it can be used wherever `MockFoo` is accepted.
it_it: `NiceMock<MockFoo>` è una sottoclasse di `MockFoo`, quindi può essere utilizzata ovunque sia accettata `MockFoo`.

source: `NiceMock<T>` is a subclass of `T`, so it can be used wherever an object of type `T` is accepted.
it_it: `NiceMock<T>` è una sottoclasse di `T`, quindi può essere utilizzata ovunque sia accettato un oggetto di tipo `T`.

source: `NiceMock<T>` might not work correctly if the destructor of `T` is not virtual.
it_it: `NiceMock<T>` potrebbe non funzionare correttamente se il distruttore di `T` non è virtuale.

source: `NiceMock<T>` only works for mock methods defined using the `MOCK_METHOD` macro directly in the definition of class `T`.
it_it: `NiceMock<T>` funziona solo con metodi mock definiti utilizzando la macro `MOCK_METHOD` direttamente nella definizione della classe `T`.

source: `ON_CALL` defines what happens when a mock method is called, but <em>doesn't imply any expectation on the method being called</em>.
it_it: `ON_CALL` definisce cosa succede quando viene chiamato un metodo mock, ma <em>non implica alcuna aspettativa [expectation] sul metodo che viene chiamato</em>.

source: `ON_CALL` has a similar syntax to `EXPECT_CALL`, but it is used for setting default behaviors when you do not require that the mock method is called.
it_it: `ON_CALL` ha una sintassi simile a `EXPECT_CALL`, ma viene utilizzato per impostare comportamenti di default quando non è necessario che venga chiamato il metodo mock.

source: `OnceAction` is typically relevant only when supporting move-only types or actions that want a type-system guarantee that they will be called at most once.
it_it: `OnceAction` è in genere rilevante solo quando si supportano tipi o azioni move-only che richiedono che un type-system garantisca che verranno chiamati al massimo una volta.

source: `Pets/FooTest.DoesBlah/0` for `"cat"`
it_it: `Pets/FooTest.DoesBlah/0` per `"cat"`

source: `Pets/FooTest.DoesBlah/1` for `"dog"`
it_it: `Pets/FooTest.DoesBlah/1` per `"dog"`

source: `Pets/FooTest.HasBlahBlah/0` for `"cat"`
it_it: `Pets/FooTest.HasBlahBlah/0` per `"cat"`

source: `Pets/FooTest.HasBlahBlah/1` for `"dog"`
it_it: `Pets/FooTest.HasBlahBlah/1` per `"dog"`

source: `Point` above could be formatted as `"(%v, %v)"` for example, and deduce the `int` values as `%d`.
it_it: Il `Point` sopra potrebbe, per esempio, essere formattato come `"(%v, %v)"` e dedurre i valori `int` come `%d`.

source: `Pointee(m)` matches a pointer if and only if `m` matches the value the pointer points to.
it_it: `Pointee(m)` esegue il matching di un puntatore se e solo se `m` corrisponde al valore a cui punta il puntatore.

source: `RUN_ALL_TESTS()` always calls `TearDown()` with each environment object, regardless of whether or not the tests were run.
it_it: `RUN_ALL_TESTS()` chiama sempre `TearDown()` con ciascun oggetto dell'ambiente, indipendentemente dal fatto che i test siano stati eseguiti o meno.

source: `RUN_ALL_TESTS()` should be invoked after the command line has been parsed by [`InitGoogleTest()`](#InitGoogleTest).
it_it: `RUN_ALL_TESTS()` deve essere richiamato dopo che la riga di comando è stata analizzata da [`InitGoogleTest()`](#InitGoogleTest).

source: `RecordProperty()` is a static member of the `Test` class.
it_it: `RecordProperty()` è un membro statico della classe `Test`.

source: `RecordProperty` is `public static` so it can be called from utility functions that are not members of the test fixture.
it_it: `RecordProperty` è `public static` quindi può essere chiamato da funzioni di utilità che non sono membri della fixture.

source: `ReturnPointee(pointer)` was provided to solve this problem specifically.
it_it: `ReturnPointee(pointer)` è stato fornito per risolvere specificamente questo problema.

source: `SCOPED_TRACE` macro will cause the current file name, line number, and the given message to be added in every failure message.
it_it: La macro `SCOPED_TRACE` farà sì che il nome del file corrente, il numero di riga e il messaggio specificato vengano aggiunti in ogni messaggio di errore.

source: `ScopedTrace` accepts explicit file name and line number in arguments, which is useful for writing test helpers.
it_it: `ScopedTrace` accetta nomi di file e numeri di riga espliciti negli argomenti, il che è utile per scrivere helper di test.

source: `SetArgPointee()` conveniently makes an internal copy of the value you pass to it, removing the need to keep the value in scope and alive.
it_it: `SetArgPointee()` crea comodamente una copia interna del valore che gli si passa, eliminando la necessità di mantenere il valore nello scope e in vita [alive].

source: `SetArgPointee()` says what the side effect is, but doesn't say what the return value should be.
it_it: `SetArgPointee()` dice qual è l'effetto collaterale, ma non dice quale dovrebbe essere il valore restituito.

source: `StrictMock<T>` is a subclass of `T`, so it can be used wherever an object of type `T` is accepted.
it_it: `StrictMock<T>` è una sottoclasse di `T`, quindi può essere utilizzata ovunque sia accettato un oggetto di tipo `T`.

source: `StrictMock<T>` might not work correctly if the destructor of `T` is not virtual.
it_it: `StrictMock<T>` potrebbe non funzionare correttamente se il distruttore di `T` non è virtuale.

source: `StrictMock<T>` only works for mock methods defined using the `MOCK_METHOD` macro directly in the definition of class `T`.
it_it: `StrictMock<T>` funziona solo con metodi mock definiti utilizzando la macro `MOCK_METHOD` direttamente nella definizione della classe `T`.

source: `TEST()` and `TEST_F()` implicitly register their tests with GoogleTest.
it_it: `TEST()` e `TEST_F()` registrano implicitamente i loro test con GoogleTest.

source: `TEST()` arguments go from general to specific.
it_it: Gli argomenti di `TEST()` vanno dal generale allo specifico.

source: `T` can be any copyable type.
it_it: `T` può essere qualsiasi tipo copiabile.

source: `TestResult` is not copyable.
it_it: `TestResult` non è copiabile.

source: `TestSuite` is not copyable.
it_it: `TestSuite` non è copiabile.

source: `Test` is not copyable.
it_it: `Test` non è copiabile.

source: `UnitTest` is a singleton class.
it_it: `UnitTest` è una classe singleton.

source: `UnitTest` is not copyable.
it_it: `UnitTest` non è copiabile.

source: `UnorderedElementsAreArray({e0, e1, ..., en})`, `UnorderedElementsAreArray(a_container)`, `UnorderedElementsAreArray(begin, end)`, `UnorderedElementsAreArray(array)`, or `UnorderedElementsAreArray(array, count)`
it_it: `UnorderedElementsAreArray({e0, e1, ..., en})`, `UnorderedElementsAreArray(a_container)`, `UnorderedElementsAreArray(begin, end)`, `UnorderedElementsAreArray(array)` o `UnorderedElementsAreArray(array, count)`

source: `ValuesIn(container)` or `ValuesIn(begin,end)`
it_it: `ValuesIn(container)` o `ValuesIn(begin,end)`

source: `WithArg<N>(action)` (no `s` after `Arg`) when the inner `action` takes *one* argument.
it_it: `WithArg<N>(action)` (nessuna `s` dopo `Arg`) quando l'`action` interna prende *un* argomento.

source: `WithoutArgs(action)` when the inner `action` takes *no* argument, and
it_it: `WithoutArgs(action)` quando l'`action` interna accetta *nessun* argomento, e

source: `_` is a convenient way of saying "any value".
it_it: `_` è un modo conveniente per dire "qualsiasi valore".

source: `_` is an instance of what we call **matchers**.
it_it: `_` è un'istanza di quelle che chiamiamo **matcher**.

source: `a` must not return void.
it_it: `a` non deve restituire void.

source: `argument.field` (or `argument->field` when `argument` is a plain pointer) matches matcher `m`, where `argument` is an object of type _class_.
it_it: `argument.field` (o `argument->field` quando `argument` è un puntatore semplice) corrisponde al matcher `m`, dove `argument` è un oggetto di tipo _class_.

source: `argument.first` matches `e`, which can be either a value or a matcher.
it_it: `argument.first` corrisponde a `e`, che può essere un valore o un matcher.

source: `argument.property()` (or `argument->property()` when `argument` is a plain pointer) matches matcher `m`, where `argument` is an object of type _class_.
it_it: `argument.property()` (o `argument->property()` quando `argument` è un puntatore semplice) corrisponde al matcher `m`, dove `argument` è un oggetto di tipo _class_.

source: `argument` (either a smart pointer or a raw pointer) contains a pointer that matches `m`.
it_it: `argument` (un puntatore intelligente o un puntatore semplice) contiene un puntatore che corrisponde a `m`.

source: `argument` (either a smart pointer or a raw pointer) points to a value that matches matcher `m`.
it_it: `argument` (un puntatore intelligente o un puntatore semplice) punta a un valore che corrisponde al matcher `m`.

source: `argument` can be any value of the correct type.
it_it: `argument` può essere qualsiasi valore del tipo corretto.

source: `argument` can be any value of type `type`.
it_it: `argument` può essere qualsiasi valore di tipo `type`.

source: `argument` contains `string` as a sub-string.
it_it: `argument` contiene la sotto-stringa `string`.

source: `argument` contains an element that matches `e`, which can be either a value or a matcher.
it_it: `argument` contiene un elemento che corrisponde a `e`, che può essere un valore o un matcher.

source: `argument` contains elements that match `e`, which can be either a value or a matcher, and the number of matches is `n`, which can be either a value or a matcher.
it_it: `argument` contiene elementi che corrispondono a `e`, che può essere un valore o un matcher, e il numero di corrispondenze è `n`, che può essere un valore o un matcher.

source: `argument` contains the same number of elements as in `container`, and for all i, (the i-th element in `argument`, the i-th element in `container`) match `m`, which is a matcher on 2-tuples.
it_it: `argument` contiene lo stesso numero di elementi di `container` e per tutti gli i, (l'i-esimo elemento in `argument`, l'i-esimo elemento `container`) corrisponde a `m`, che è un matcher su delle 2-tuple.

source: `argument` doesn't match matcher `m`.
it_it: `argument` non corrisponde al matcher `m`.

source: `argument` ends with string `suffix`.
it_it: `argument` termina con la stringa `suffix`.

source: `argument` evaluates to `false` in a Boolean context.
it_it: `argument` valutato `false` in un contesto booleano.

source: `argument` evaluates to `true` in a Boolean context.
it_it: `argument` valuatato `true` in un contesto booleano.

source: `argument` has `n + 1` elements, and under *some* permutation of the elements, each element matches an `ei` (for a different `i`), which can be a value or a matcher.
it_it: `argument` ha `n + 1` elementi e, con *qualche* permutazione degli elementi, ogni elemento corrisponde a `ei` (per un diverso `i`), che può essere un valore o un matcher.

source: `argument` has `n + 1` elements, where the *i*-th element matches `ei`, which can be a value or a matcher.
it_it: `argument` ha `n + 1` elementi, dove l'*i*-esimo elemento corrisponde a `ei`, che può essere un valore o un matcher.

source: `argument` has type `type` and is equal to `value`.
it_it: `argument` ha tipo `type` ed è uguale a `value`.

source: `argument` is `optional<>` that contains a value matching `m`.
it_it: `argument` è `optional<>` che contiene un valore che coincide con `m`.

source: `argument` is `variant<>` that holds the alternative of type T with a value matching `m`.
it_it: `argument` è un `variant<>` che contiene l'alternativa di tipo T con un valore corrispondente a `m`.

source: `argument` is a `NULL` pointer (raw or smart).
it_it: `argument` è un puntatore `NULL` (raw o smart).

source: `argument` is a `double` value approximately equal to `a_double`, treating two NaNs as equal.
it_it: `argument` è un valore `double` approssimativamente uguale a `a_double`, trattando due NaN uguali.

source: `argument` is a `double` value approximately equal to `a_double`, treating two NaNs as unequal.
it_it: `argument` è un valore `double` approssimativamente uguale a `a_double`, trattando due NaN come diversi.

source: `argument` is a `double` value close to `a_double` (absolute error <= `max_abs_error`), treating two NaNs as equal.
it_it: `argument` è un valore `double` vicino a `a_double` (absolute error <= `max_abs_error`), considera due NaN come uguali.

source: `argument` is a `double` value close to `a_double` (absolute error <= `max_abs_error`), treating two NaNs as unequal.
it_it: `argument` è un valore `double` vicino a `a_double` (absolute error <= `max_abs_error`), considera due NaN come diversi.

source: `argument` is a `float` value approximately equal to `a_float`, treating two NaNs as equal.
it_it: `argument` è un valore `float` approssimativamente uguale a `a_float`, trattando due NaN uguali.

source: `argument` is a `float` value approximately equal to `a_float`, treating two NaNs as unequal.
it_it: `argument` è un valore `float` approssimativamente uguale a `a_float`, trattando due NaN come diversi.

source: `argument` is a `float` value close to `a_float` (absolute error <= `max_abs_error`), treating two NaNs as equal.
it_it: `argument` è un valore `float` vicino a `a_float` (absolute error <= `max_abs_error`), considera due NaN come uguali.

source: `argument` is a `float` value close to `a_float` (absolute error <= `max_abs_error`), treating two NaNs as unequal.
it_it: `argument` è un valore `float` vicino a `a_float` (absolute error <= `max_abs_error`), considera due NaN come diversi.

source: `argument` is a base-64 escaped string whose unescaped string matches `m`.
it_it: `argument` è una stringa con escape in base 64 la cui stringa senza escape corrisponde a `m`.

source: `argument` is a compatible object where each field matches piecewise with the matchers `m...`.
it_it: `argument` è un oggetto compatibile in cui ogni campo corrisponde a pezzi con i matcher `m...`.

source: `argument` is a container where *every* element matches `e`, which can be either a value or a matcher.
it_it: `argument` è un contenitore in cui *ogni* elemento corrisponde a `e`, che può essere un valore o un matcher.
